"""
@File        :   exclude_words.py
@Description :   some key words that should be excluded from the dataset,
                    including topics, texts and retweet topics and texts
@Time        :   2024/11/08
"""

exclude_topics = ['肖战', '微博', '超话', '王一博', '剧', '黑马剧', '运河有戏', '我在', '好帅',
                  '立白洗衣凝珠', '生活的模样', '萌娃养成记', '我的美食日记', '好物推荐', 
                  '时尚穿搭', '麦当劳铲子', '见未来', '寻美', '唐诗宋词', '早起打卡', '旅游', '过年',
                  '我的夏日look', '电影正当夏', '幽你一默', '点赞网络正能量', '迷惑行为大赏', '分享',
                  '风起洛阳', 'Jpais球', '小测试', '购物节', '国门之巅', '跟着古人去遨游', '下班路上',
                  '不营业就捣蛋', '邮箱', '音乐人', '歌手', '演员', '仪式感', '爱看', '爱吃', '中国记者节',
                  '士兵突击', '专用', '实时', '深夜树洞', 'QQ音乐', '腾讯音乐', '网易云', '好吃', 'HYBE',
                  '出道', 'hybe', '荣梓杉', '内巡', '因为我爱她', '径山花海', '你好疯子', '成毅直播', '手写沉',
                  '带着边框一起拍', '你好', '佳片奇遇季', 'MVP', '金球奖', '运动打卡', '吃货节', '生活日记',
                  '博蕴龙礼', '霸王茶姬', '年货节', '海之言', '人鱼线的PDD', '平番', '最后一舞', '雪雪雪',
                  '创作大会', '随手拍', '挑战赛', '创造营', '秋季赛', 'whiplash', '攻击性最强的一集', '小巷人家',
                  '走秀', '潮人', '筱烊反黑', '翁青雅', '万圣节', '中秋快乐', '反黑记录', '每日', '变装',
                  '你好星期六下期是锦绣安宁', '你自己看看这有吗', '日志', '夏悦悦悦悦', '初音未来', '婚礼',
                  '电影票房', '生图', '看比赛', 'iQOO13', '小妲己春日送花花', '招财小猫咪'
                  ]

exclude_texts = ['@', '肖战',  '一博', '少年团', 'BTS', 'EXO', '李现', '报道称', '宝贝', '小可爱',
                 '王俊凯', '易烊千玺', '朱一龙', '杨紫', '杨幂', '杨洋', '布庶', '人气王',
                 '迪丽热巴', '杨幂', '健康守护计划', '夏日大赏', '王者', '【', '仙台有树',
                 '吃鸡', '和平精英', '发布了头条文章：', '代言人', '吴磊', '阎鹤祥', '首发',
                 '种植方法', '生日', '那年今日专栏', '裴真率', '金秋天', '每日一善', '早安',
                 '张杰', '黄子弘凡', '剧版', '练习日常', '龚俊', '杨博文', '爱豆', '歌剧院',
                 '朴彩英', '森林驿站', '蜀黍说安全', '投票：', '檀健次', '动态视频', '分享图片',
                 '总台记者', '现金大奖', '大回馈', '邓为', '手游', '博君一肖', 'SVIP体验卡',
                 '魏大勋', '大秀', '天猫双11', '双11烟火之约', '秦霄贤', '生活手记', '转发微博',
                 '男团', '针锋对决', '生活随拍', '一诺的1226号信箱', '碎碎念', '闲聊', '帅', '少年组合',
                 '投票', '林孝埈', '好美', '鞠婧祎', '刘昊然', '性感', '美', '今天jer个样', '[超话]',
                 '曾舜晞', '黄油小熊', '金桔专测gct', '诗情画奕', '崽崽', '陆沉', '实时检测', '光与夜之恋',
                 '权志龙', '苏新皓', '抽奖', '林彦俊', '花呗', '新中式茶饮', '攒金', '爱你', '可爱',
                 'susu福福', '主唱', '盲盒旅行局', '于适', '老公', '老婆', '专用实时', '宝宝', '鑫程',
                 '主题曲', '演唱会', 'angelababy', '粉丝', '刘青松', '好萌', '欧巴', '啊啊啊啊', '原神',
                 '吃鸡', '黄磊', '秦彻', '心上人', '娇妻', '85', '花少', 'BLACKPINK', '黄明昊', '综艺',
                 '动图', '我投给了', '向佐', '阳光信用', '迎接锦鲤', '转发', '接好运', '总决赛', '宋智孝',
                 '预告片', '六颜一', '省钱攻略', '杨子', '王烁', '晚安', '午安', '花少', '明浩', '韩安冉',
                 '看看我', '签到', '联动', '来了来了', '我推荐了', '乔欣', '零封', '山花烂漫时', '张艺兴', 
                 '品牌挚友', '绘旅人', '第五人格', '乙游', '每日一题', '少帮主', '心动', 'follow榜', 'cp',
                 'CP', '不见不散', '封面', 'N号房', '意难平', '国产剧', '韩剧', 'HPV公开课', '双十一',
                 '助力', '战至巅峰', '共创', '不顾一切热爱', '陈哲远', '赵小棠', '张泽禹', '发布会', '王默',
                 '水王子', '水默', '新歌', '刘耀文', '朱志鑫', '熊猫守护者', '加油助威', '碎碎唸', '上链接',
                 '孙策', '品牌大使', '爱死', '周三快乐', '奇文', '定档', '莲花楼', '杨超越', '会员头像特权',
                 '赵露思', '今日开播', '正式确诊为烤肠', '大梦归离', '侯明昊', '点天灯', '贺峻霖', 'TF',
                 '预制风还是吹到了婚礼圈', '林钰珊', '优酷预约', '微博预约', '永夜星河', '谁是AI', '鹿晗',
                 '最佳选手', '何炅', '黄旭熙', '全国公测', '漫视界企划', '如鸢', '开服', '在线营业', '快来加入',
                 'idjdj', '专栏', '刘晓庆', '陈浚铭', '虞书欣', '谭松韵', '珠帘玉幕', '人人运动家', '公益赞赏',
                 '宋雨琦', '看见公益', '柳智敏', '个人单曲', '预告照', '游戏福利中心', '刘诗诗', '一念关山'
                 ]

exclude_retweet_topics = ['生日', '代言', '签名', '周边', '蔻斯汀', '鹅厂片单', '一秒惊艳的新舞台',
                          '宝藏歌单', 'QQ音乐', '腾讯音乐', '网易云', '抽奖', '电影解密']

exclude_retweet_texts = ['查看权限', '微博视界大会', '微博之夜', '邓为', '微博直播', '转赞评', '粉丝',
                         '高定封面', '幽你一默', '抽奖', '此微博已不可见', '签名照', '边伯贤', '空降',
                         '演唱会', '今日上新', '剑网3', '已无法查看', '刘昊然', '接福', '少年组合', 'TF',
                         '苏新皓', '分享', '王俊凯', 'susu福福', '主唱', '盲盒旅行局', '于适', '新歌',
                         '恋与深空', '原神', '麦当劳铲子', '综艺', '每日一善', '阳光信用', '六颜一', '转发',
                         '见扩', '签到', '福袋', '宠粉', '摩登', '王一博', '张艺兴', '增刊', '封面', '舞台',
                         '音乐人', '定档', '官宣']